; domain
; Source: https://github.com/AI-Planning/pddl-generators/tree/main/miconic
; Fix: prevent the elevator from boarding served passengers => (not (origin ?p ?f)) effect added to board action
(define (domain miconic)
  (:requirements :strips :typing)
  (:types passenger - object
          floor - object
         )

(:predicates 
(origin ?person - passenger ?floor - floor)
;; entry of ?person is ?floor
;; inertia

(destin ?person - passenger ?floor - floor)
;; exit of ?person is ?floor
;; inertia

(above ?floor1 - floor  ?floor2 - floor)
;; ?floor2 is located above of ?floor1

(boarded ?person - passenger)
;; true if ?person has boarded the lift

(served ?person - passenger)
;; true if ?person has alighted as her destination

(lift-at ?floor - floor)
;; current position of the lift is at ?floor
)


;;stop and allow boarding

(:action board
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (origin ?p ?f))
  :effect (and (boarded ?p) (not (origin ?p ?f))))

(:action depart
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (destin ?p ?f)
		     (boarded ?p))
  :effect (and (not (boarded ?p))
	       (served ?p)))
;;drive up

(:action up
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f1 ?f2))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))


;;drive down

(:action down
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f2 ?f1))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))
)

; problem
;; passengers=4, floors=10, out_folder=training/easy, instance_id=45, seed=72

(define (problem miconic-45)
 (:domain miconic)
 (:objects 
    p1 p2 p3 p4 - passenger
    f1 f2 f3 f4 f5 f6 f7 f8 f9 f10 - floor
    )
 (:init 
    (lift-at f2)
    (origin p1 f10)
    (destin p1 f3)
    (origin p2 f6)
    (destin p2 f10)
    (origin p3 f10)
    (destin p3 f6)
    (origin p4 f5)
    (destin p4 f3)
    (above f1 f2)
    (above f1 f3)
    (above f1 f4)
    (above f1 f5)
    (above f1 f6)
    (above f1 f7)
    (above f1 f8)
    (above f1 f9)
    (above f1 f10)
    (above f2 f3)
    (above f2 f4)
    (above f2 f5)
    (above f2 f6)
    (above f2 f7)
    (above f2 f8)
    (above f2 f9)
    (above f2 f10)
    (above f3 f4)
    (above f3 f5)
    (above f3 f6)
    (above f3 f7)
    (above f3 f8)
    (above f3 f9)
    (above f3 f10)
    (above f4 f5)
    (above f4 f6)
    (above f4 f7)
    (above f4 f8)
    (above f4 f9)
    (above f4 f10)
    (above f5 f6)
    (above f5 f7)
    (above f5 f8)
    (above f5 f9)
    (above f5 f10)
    (above f6 f7)
    (above f6 f8)
    (above f6 f9)
    (above f6 f10)
    (above f7 f8)
    (above f7 f9)
    (above f7 f10)
    (above f8 f9)
    (above f8 f10)
    (above f9 f10)
)
 (:goal  (and (served p1)
   (served p2)
   (served p3)
   (served p4))))

; plan
1. (up f2 f5)
   deleted: (lift-at f2)
   added: (lift-at f5)
   goals met: 0 of 4
2. (board f5 p4)
   deleted: (origin p4 f5)
   added: (boarded p4)
   goals met: 0 of 4
3. (up f5 f10)
   deleted: (lift-at f5)
   added: (lift-at f10)
   goals met: 0 of 4
4. (board f10 p3)
   deleted: (origin p3 f10)
   added: (boarded p3)
   goals met: 0 of 4
5. (board f10 p1)
   deleted: (origin p1 f10)
   added: (boarded p1)
   goals met: 0 of 4
6. (down f10 f3)
   deleted: (lift-at f10)
   added: (lift-at f3)
   goals met: 0 of 4
7. (depart f3 p4)
   deleted: (boarded p4)
   added: (served p4)
   goals met: 1 of 4
8. (depart f3 p1)
   deleted: (boarded p1)
   added: (served p1)
   goals met: 2 of 4
9. (up f3 f6)
   deleted: (lift-at f3)
   added: (lift-at f6)
   goals met: 2 of 4
10. (depart f6 p3)
   deleted: (boarded p3)
   added: (served p3)
   goals met: 3 of 4
11. (board f6 p2)
   deleted: (origin p2 f6)
   added: (boarded p2)
   goals met: 3 of 4
12. (up f6 f10)
   deleted: (lift-at f6)
   added: (lift-at f10)
   goals met: 3 of 4
13. (depart f10 p2)
   deleted: (boarded p2)
   added: (served p2)
   goals met: 4 of 4
